if OS.mac?
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    cask "font-3270-nerd-font"
    cask "font-cascadia-mono"
    cask "font-cascadia-code"
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-meslo-lg-nerd-font"
    cask "font-victor-mono"

    cask "kitty"
    cask "launchbar"
    cask "sublime-text"
    cask "vlc"
end

tap "homebrew/bundle"
tap "homebrew/core"

brew "ansible"
brew "bash"
brew "bat"
brew "coreutils"
brew "fd"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "htop"
brew "hyperfine"
brew "jq"
brew "libdvdcss"
brew "make"
brew "mosh"
brew "neovim"
brew "nmap"
brew "optipng"
brew "parallel"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "terraform"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "zsh-completions"

# pyenv
brew "openssl"
brew "readline"
brew "sqlite"
brew "xz" 
brew "zlib"
